Revit 2026 API

# RibbonItemVisible Property

---

Gets or sets a value indicating whether the item is visible.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool Visible { get; set; }
```
```vb
Public Property Visible As Boolean
	Get
	Set
```
```cpp
public:
property bool Visible {
	bool get ();
	void set (bool value);
}
```
```fsharp
member Visible : bool with get, set
```

#### Property Value

Boolean

When the Visible property is set to false, the item won't be displayed on Ribbon.

#### Reference

RibbonItem Class

Autodesk.Revit.UI Namespace